app/controllers/constellations_controller.rb

SELECT "constellations".* FROM "constellations"
---
    def index
        render json: Constellation.all, status: :ok

SELECT "constellations".* FROM "constellations" WHERE "constellations"."id" = $1 LIMIT $2  [["id", 90], ["LIMIT", 1]]
---
    def find_constellation
        Constellation.find(params[:id])