app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "testing"], ["password", "test"], ["created_at", "2022-03-28 20:59:05.062399"], ["updated_at", "2022-03-28 20:59:05.062399"]]
---
    def create
        user = User.create!(user_params)